Revit 2027 API
BuiltInFailures.RebarFailures.CannotKeepVariabilityOfRebarInGroup Property
 Modifications to the rebar set might cause it to revert to a uniform distribution and reset all disabled constraints. This can occur for layout changes as well as modifications to the geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepVariabilityOfRebarInGroup { get; }
Public Shared ReadOnly Property CannotKeepVariabilityOfRebarInGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepVariabilityOfRebarInGroup {
	FailureDefinitionId^ get ();
}
static member CannotKeepVariabilityOfRebarInGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace